mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>WDV</name>
                                <description>Watchdog Value. Acutal Message RAM Watchdog Counter Value.
 
The RAM Watchdog monitors the READY output of the Message RAM. A Message RAM access via the MCAN's Generic Master Interface starts the Message RAM Watchdog Counter with the value configured by the WDC field. The counter is reloaded with WDC when the Message RAM signals successful completion by activating its READY output. In case there is no response from the Message RAM until the counter has counted down to zero, the counter stops and interrupt flag MCAN_IR.WDI is set. The RAM Watchdog Counter is clocked by the host (system) clock.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_CCCR</name>
                        <description>MCAN CC Control Register</description>
                        <addressOffset>0x18</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000001</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>INIT</name>
                                <description>Initialization
  0  Normal Operation
  1  Initialization is started
Note: Due to the synchronization mechanism between the two clock domains, there may be a delay until the value written to INIT can be read back. Therefore the programmer has to assure that the previous value written to INIT has been accepted by reading INIT before setting INIT to a new value.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CCE</name>
                                <description>Configuration Change Enable
  0  The CPU has no write access to the protected configuration registers
  1  The CPU has write access to the protected configuration registers (while CCCR.INIT = '1')
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ASM</name>
                                <description>Restricted Operation Mode. Bit ASM can only be set by SW when both CCE and INIT are set to '1'. The bit can be reset by SW at any time.
  0  Normal CAN operation
  1  Restricted Operation Mode active
 
Qualified Write 1 to Set is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CSA</name>
                                <description>Clock Stop Acknowledge
  0  No clock stop acknowledged
  1  MCAN may be set in power down by stopping the Host and CAN clocks</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>CSR</name>
                                <description>Clock Stop Request
  0  No clock stop is requested
  1  Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>MON</name>
                                <description>Bus Monitoring Mode. Bit MON can only be set by SW when both CCE and INIT are set to '1'. The bit can be reset by SW at any time.
  0  Bus Monitoring Mode is disabled
  1  Bus Monitoring Mode is enabled
 
Qualified Write 1 to Set is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DAR</name>
                                <description>Disable Automatic Retransmission
  0  Automatic retransmission of messages not transmitted successfully enabled
  1  Automatic retransmission disabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEST</name>
                                <description>Test Mode Enable
  0  Normal operation, register TEST holds reset values
  1  Test Mode, write access to register TEST enabled
 
