mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                    <register>
                        <name>CANFD0_MCAN_IE</name>
                        <description>MCAN Interrupt Enable</description>
                        <addressOffset>0x54</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RF0NE</name>
                                <description>Rx FIFO 0 New Message Enable</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0WE</name>
                                <description>Rx FIFO 0 Watermark Reached Enable</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0FE</name>
                                <description>Rx FIFO 0 Full Enable</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0LE</name>
                                <description>Rx FIFO 0 Message Lost Enable</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1NE</name>
                                <description>Rx FIFO 1 New Message Enable</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1WE</name>
                                <description>Rx FIFO 1 Watermark Reached Enable</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1FE</name>
                                <description>Rx FIFO 1 Full Enable</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1LE</name>
                                <description>Rx FIFO 1 Message Lost Enable</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>HPME</name>
                                <description>High Priority Message Enable</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TCE</name>
                                <description>Transmission Completed Enable</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TCFE</name>
                                <description>Transmission Cancellation Finished Enable</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TFEE</name>
                                <description>Tx FIFO Empty Enable</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFNE</name>
                                <description>Tx Event FIFO New Entry Enable</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFWE</name>
                                <description>Tx Event FIFO Watermark Reached Enable</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFFE</name>
                                <description>Tx Event FIFO Full Enable</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFLE</name>
                                <description>Tx Event FIFO Element Lost Enable</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TSWE</name>
                                <description>Timestamp Wraparound Enable</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>MRAFE</name>
                                <description>Message RAM Access Failure Enable</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TOOE</name>
                                <description>Timeout Occurred Enable</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DRXE</name>
                                <description>Message Stored to Dedicated Rx Buffer Enable</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BECE</name>
                                <description>Bit Error Corrected Enable
 
A separate interrupt line reserved for corrected bit errors is provided via the MCAN_ERROR_REGS. It advised for the user to use these registers and leave this bit cleared to '0'.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BEUE</name>
                                <description>Bit Error Uncorrected Enable</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ELOE</name>
                                <description>Error Logging Overflow Enable</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EPE</name>
                                <description>Error Passive Enable</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EWE</name>
                                <description>Warning Status Enable</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BOE</name>
                                <description>Bus_Off Status Enable</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>WDIE</name>
                                <description>Watchdog Interrupt Enable</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PEAE</name>
                                <description>Protocol Error in Arbitration Phase Enable</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PEDE</name>
                                <description>Protocol Error in Data Phase Enable</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ARAE</name>
                                <description>Access to Reserved Address Enable</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_ILS</name>
                        <description>MCAN Interrupt Line Select</description>
                        <addressOffset>0x58</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RF0NL</name>
                                <description>Rx FIFO 0 New Message Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0WL</name>
                                <description>Rx FIFO 0 Watermark Reached Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0FL</name>
                                <description>Rx FIFO 0 Full Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0LL</name>
                                <description>Rx FIFO 0 Message Lost Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1NL</name>
                                <description>Rx FIFO 1 New Message Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1WL</name>
                                <description>Rx FIFO 1 Watermark Reached Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1FL</name>
                                <description>Rx FIFO 1 Full Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1LL</name>
                                <description>Rx FIFO 1 Message Lost Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>HPML</name>
                                <description>High Priority Message Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TCL</name>
                                <description>Transmission Completed Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TCFL</name>
                                <description>Transmission Cancellation Finished Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TFEL</name>
                                <description>Tx FIFO Empty Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFNL</name>
                                <description>Tx Event FIFO New Entry Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFWL</name>
                                <description>Tx Event FIFO Watermark Reached Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFFL</name>
                                <description>Tx Event FIFO Full Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFLL</name>
                                <description>Tx Event FIFO Element Lost Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TSWL</name>
                                <description>Timestamp Wraparound Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>MRAFL</name>
                                <description>Message RAM Access Failure Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TOOL</name>
                                <description>Timeout Occurred Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DRXL</name>
                                <description>Message Stored to Dedicated Rx Buffer Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BECL</name>
                                <description>Bit Error Corrected Line
 
