mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                    <register>
                        <name>CANFD0_MCAN_NDAT2</name>
                        <description>MCAN New Data 2</description>
                        <addressOffset>0x9C</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ND32</name>
                                <description>New Data RX Buffer 32
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND33</name>
                                <description>New Data RX Buffer 33
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND34</name>
                                <description>New Data RX Buffer 34
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND35</name>
                                <description>New Data RX Buffer 35
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND36</name>
                                <description>New Data RX Buffer 36
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND37</name>
                                <description>New Data RX Buffer 37
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND38</name>
                                <description>New Data RX Buffer 38
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND39</name>
                                <description>New Data RX Buffer 39
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND40</name>
                                <description>New Data RX Buffer 40
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND41</name>
                                <description>New Data RX Buffer 41
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND42</name>
                                <description>New Data RX Buffer 42
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND43</name>
                                <description>New Data RX Buffer 43
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND44</name>
                                <description>New Data RX Buffer 44
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND45</name>
                                <description>New Data RX Buffer 45
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND46</name>
                                <description>New Data RX Buffer 46
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND47</name>
                                <description>New Data RX Buffer 47
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND48</name>
                                <description>New Data RX Buffer 48
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND49</name>
                                <description>New Data RX Buffer 49
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND50</name>
                                <description>New Data RX Buffer 50
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND51</name>
                                <description>New Data RX Buffer 51
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND52</name>
                                <description>New Data RX Buffer 52
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND53</name>
                                <description>New Data RX Buffer 53
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND54</name>
                                <description>New Data RX Buffer 54
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND55</name>
                                <description>New Data RX Buffer 55
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND56</name>
                                <description>New Data RX Buffer 56
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND57</name>
                                <description>New Data RX Buffer 57
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND58</name>
                                <description>New Data RX Buffer 58
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND59</name>
                                <description>New Data RX Buffer 59
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND60</name>
                                <description>New Data RX Buffer 60
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND61</name>
                                <description>New Data RX Buffer 61
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND62</name>
                                <description>New Data RX Buffer 62
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ND63</name>
                                <description>New Data RX Buffer 63
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXF0C</name>
                        <description>MCAN Rx FIFO 0 Configuration</description>
                        <addressOffset>0xA0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F0SA</name>
                                <description>Rx FIFO 0 Start Address. Start address of Rx FIFO 0 in Message RAM (32-bit word address).
 
