mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                    <register>
                        <name>CANFD0_MCAN_TXBTIE</name>
                        <description>MCAN Tx Buffer Transmission Interrupt Enable</description>
                        <addressOffset>0xE0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TIE0</name>
                                <description>Transmission Interrupt Enable 0. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE1</name>
                                <description>Transmission Interrupt Enable 1. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE2</name>
                                <description>Transmission Interrupt Enable 2. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE3</name>
                                <description>Transmission Interrupt Enable 3. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE4</name>
                                <description>Transmission Interrupt Enable 4. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE5</name>
                                <description>Transmission Interrupt Enable 5. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE6</name>
                                <description>Transmission Interrupt Enable 6. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE7</name>
                                <description>Transmission Interrupt Enable 7. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE8</name>
                                <description>Transmission Interrupt Enable 8. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE9</name>
                                <description>Transmission Interrupt Enable 9. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE10</name>
                                <description>Transmission Interrupt Enable 10. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE11</name>
                                <description>Transmission Interrupt Enable 11. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE12</name>
                                <description>Transmission Interrupt Enable 12. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE13</name>
                                <description>Transmission Interrupt Enable 13. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE14</name>
                                <description>Transmission Interrupt Enable 14. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE15</name>
                                <description>Transmission Interrupt Enable 15. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE16</name>
                                <description>Transmission Interrupt Enable 16. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE17</name>
                                <description>Transmission Interrupt Enable 17. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE18</name>
                                <description>Transmission Interrupt Enable 18. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE19</name>
                                <description>Transmission Interrupt Enable 19. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE20</name>
                                <description>Transmission Interrupt Enable 20. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE21</name>
                                <description>Transmission Interrupt Enable 21. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE22</name>
                                <description>Transmission Interrupt Enable 22. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE23</name>
                                <description>Transmission Interrupt Enable 23. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE24</name>
                                <description>Transmission Interrupt Enable 24. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE25</name>
                                <description>Transmission Interrupt Enable 25. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE26</name>
                                <description>Transmission Interrupt Enable 26. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE27</name>
                                <description>Transmission Interrupt Enable 27. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE28</name>
                                <description>Transmission Interrupt Enable 28. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE29</name>
                                <description>Transmission Interrupt Enable 29. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE30</name>
                                <description>Transmission Interrupt Enable 30. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TIE31</name>
                                <description>Transmission Interrupt Enable 31. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
