mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                    <register>
                        <name>CANFD0_MCAN_TXEFA</name>
                        <description>MCAN Tx Event FIFO Acknowledge</description>
                        <addressOffset>0xF8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EFAI</name>
                                <description>Event FIFO Acknowledge Index. After the Host has read an element or a sequence of elements from the Tx Event FIFO it has to write the index of the last element read from Tx Event FIFO to EFAI. This will set the Tx Event FIFO Get Index TXEFS.EFGI to EFAI + 1 and update the Event FIFO Fill Level TXEFS.EFFL.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>2560</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>CANFD0_TI_WRAPPER[%s]</name>
                    <description></description>
                    <addressOffset>0x7200</addressOffset>
                    <cluster>
                        <dim>1</dim>
                        <dimIncrement>1040</dimIncrement>
                        <dimArrayIndex>0</dimArrayIndex>
                        <name>CANFD0_PROCESSORS[%s]</name>
                        <description></description>
                        <addressOffset>0x0</addressOffset>
                        <cluster>
                            <dim>1</dim>
                            <dimIncrement>44</dimIncrement>
                            <dimArrayIndex>0</dimArrayIndex>
                            <name>CANFD0_MCANSS_REGS[%s]</name>
                            <description></description>
                            <addressOffset>0x0</addressOffset>
                            <register>
                                <name>CANFD0_MCANSS_PID</name>
                                <description>MCAN Subsystem Revision Register</description>
                                <addressOffset>0x0</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x68e04901</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>MINOR</name>
                                        <description>Minor Revision of the MCAN Subsystem</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x6</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>MAJOR</name>
                                        <description>Major Revision of the MCAN Subsystem</description>
                                        <bitOffset>0x8</bitOffset>
                                        <bitWidth>0x3</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>MODULE_ID</name>
                                        <description>Module Identification Number</description>
                                        <bitOffset>0x10</bitOffset>
                                        <bitWidth>0xC</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>SCHEME</name>
                                        <description>PID Register Scheme</description>
                                        <bitOffset>0x1E</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_CTRL</name>
                                <description>MCAN Subsystem Control Register</description>
                                <addressOffset>0x4</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000008</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>DBGSUSP_FREE</name>
                                        <description>Debug Suspend Free Bit. Enables debug suspend.
  0  Honor debug suspend
  1  Disregard debug suspend</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>WAKEUPREQEN</name>
                                        <description>Wakeup Request Enable. Enables the MCANSS to wakeup on CAN RXD activity.
  0  Disable wakeup request
  1  Enables wakeup request</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>AUTOWAKEUP</name>
                                        <description>Automatic Wakeup Enable. Enables the MCANSS to automatically clear the MCAN CCCR.INIT bit, fully waking the MCAN up, on an enabled wakeup request.
  0  Disable the automatic write to CCCR.INIT
  1  Enable the automatic write to CCCR.INIT</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>EXT_TS_CNTR_EN</name>
                                        <description>External Timestamp Counter Enable.
  0  External timestamp counter disabled
  1  External timestamp counter enabled</description>
                                        <bitOffset>0x6</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_STAT</name>
                                <description>MCAN Subsystem Status Register</description>
                                <addressOffset>0x8</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xfffffffb</resetMask>
                                <fields>
                                    <field>
                                        <name>RESET</name>
                                        <description>Soft Reset Status.
  0  Not in reset
  1  Reset is in progress</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>MEM_INIT_DONE</name>
                                        <description>Memory Initialization Done.
  0  Message RAM initialization is in progress
  1  Message RAM is initialized for use</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>ENABLE_FDOE</name>
                                        <description>Enable FD (Flexible Data-Rate) Configuration
Reflects the value of mcanss_enable_fdoe configuration port,
-h = mcanss_enable_fdoe.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_ICS</name>
                                <description>MCAN Subsystem Interrupt Clear Shadow Register</description>
                                <addressOffset>0xC</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow Interrupt Status Clear. Reads always return a 0.
  0  Write of '0' has no effect
  1  Write of '1' clears the MCANSS_IRS.EXT_TS_CNTR_OVFL bit</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_IRS</name>
                                <description>MCAN Subsystem Interrupt Raw Satus Register</description>
                                <addressOffset>0x10</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow Interrupt Status. This bit is set by HW or by a SW write of '1'. To clear, use the MCANSS_ICS.EXT_TS_CNTR_OVFL bit.
  0  External timestamp counter has not overflowed
  1  External timestamp counter has overflowed
 
When this bit is set to '1' by HW or SW, the MCANSS_EXT_TS_UNSERVICED_INTR_CNTR.EXT_TS_INTR_CNTR bit field will increment by 1.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_IECS</name>
                                <description>MCAN Subsystem Interrupt Enable Clear Shadow Register</description>
                                <addressOffset>0x14</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow Interrupt Enable Clear. Reads always return a 0.
  0  Write of '0' has no effect
  1  Write of '1' clears the MCANSS_IES.EXT_TS_CNTR_OVFL bit</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_IE</name>
                                <description>MCAN Subsystem Interrupt Enable Register</description>
                                <addressOffset>0x18</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow Interrupt Enable. A write of '0' has no effect. A write of '1' sets the MCANSS_IES.EXT_TS_CNTR_OVFL bit.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_IES</name>
                                <description>MCAN Subsystem Interrupt Enable Status</description>
                                <addressOffset>0x1C</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow Interrupt Enable Status. To set, use the CANSS_IE.EXT_TS_CNTR_OVFL bit. To clear, use the MCANSS_IECS.EXT_TS_CNTR_OVFL bit.
  0  External timestamp counter overflow interrupt is not enabled
  1  External timestamp counter overflow interrupt is enabled</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_EOI</name>
                                <description>MCAN Subsystem End of Interrupt</description>
                                <addressOffset>0x20</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EOI</name>
                                        <description>End of Interrupt. A write to this register will clear the associated interrupt. If the unserviced interrupt counter is &gt; 1, another interrupt is generated.
  0x00  External TS Interrupt is cleared
  0x01  MCAN(0) interrupt is cleared
  0x02  MCAN(1) interrupt is cleared
  Other writes are ignored.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x8</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_EXT_TS_PRESCALER</name>
                                <description>MCAN Subsystem External Timestamp Prescaler 0</description>
                                <addressOffset>0x24</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>PRESCALER</name>
                                        <description>External Timestamp Prescaler Reload Value. The external timestamp count rate is the host (system) clock rate divided by this value, except in the case of 0. A zero value in this bit field will act identically to a value of 0x000001.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x18</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR</name>
                                <description>MCAN Subsystem External Timestamp Unserviced Interrupts Counter</description>
                                <addressOffset>0x28</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>EXT_TS_INTR_CNTR</name>
                                        <description>External Timestamp Counter Unserviced Rollover Interrupts. If this value is &gt; 1, an MCANSS_EOI write of '1' to bit 0 will issue another interrupt.
 
The status of this bit field is affected by the MCANSS_IRS.EXT_TS_CNTR_OVFL bit field.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x5</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                        </cluster>
                        <cluster>
                            <dim>1</dim>
                            <dimIncrement>528</dimIncrement>
                            <dimArrayIndex>0</dimArrayIndex>
                            <name>CANFD0_MCAN_ECC_REGS[%s]</name>
                            <description></description>
                            <addressOffset>0x200</addressOffset>
                            <register>
                                <name>CANFD0_MCANERR_REV</name>
                                <description>MCAN Error Aggregator Revision Register</description>
                                <addressOffset>0x0</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x66a0ea00</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>REVMIN</name>
                                        <description>Minor Revision of the Error Aggregator</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x6</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>REVMAJ</name>
                                        <description>Major Revision of the Error Aggregator</description>
                                        <bitOffset>0x8</bitOffset>
                                        <bitWidth>0x3</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>MODULE_ID</name>
                                        <description>Module Identification Number</description>
                                        <bitOffset>0x10</bitOffset>
                                        <bitWidth>0xC</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>SCHEME</name>
                                        <description>PID Register Scheme</description>
                                        <bitOffset>0x1E</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
