mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                            <register>
                                <name>CANFD0_MCANERR_VECTOR</name>
                                <description>MCAN ECC Vector Register</description>
                                <addressOffset>0x8</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>ECC_VECTOR</name>
                                        <description>ECC RAM ID. Each error detection and correction (EDC) controller has a bank of error registers (offsets 0x10 - 0x3B) associated with it. These registers are accessed via an internal serial bus (SVBUS). To access them through the ECC aggregator the controller ID desired must be written to the ECC_VECTOR field, together with the RD_SVBUS trigger and RD_SVBUS_ADDRESS bit field. This initiates the serial read which consummates by setting the RD_SVBUS_DONE bit. At this point the addressed register may be read by a normal CPU read of the appropriate offset address.
  0x000  Message RAM ECC controller is selected
  Others  Reserved (do not use)
 
Subsequent writes through the SVBUS (offsets 0x10 - 0x3B) have a delayed completion. To avoid conflicts, perform a read back of a register within this range after writing.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0xB</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>RD_SVBUS</name>
                                        <description>Read Trigger</description>
                                        <bitOffset>0xF</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>RD_SVBUS_ADDRESS</name>
                                        <description>Read Address Offset</description>
                                        <bitOffset>0x10</bitOffset>
                                        <bitWidth>0x8</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>RD_SVBUS_DONE</name>
                                        <description>Read Completion Flag</description>
                                        <bitOffset>0x18</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_STAT</name>
                                <description>MCAN Error Misc Status</description>
                                <addressOffset>0xC</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000002</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>NUM_RAMS</name>
                                        <description>Number of RAMs. Number of ECC RAMs serviced by the aggregator.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0xB</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_WRAP_REV</name>
                                <description>MCAN ECC Wrapper Revision Register</description>
                                <addressOffset>0x10</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x66a46a02</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>REVMIN</name>
                                        <description>Minor Revision of the Error Aggregator</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x6</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>REVMAJ</name>
                                        <description>Major Revision of the Error Aggregator</description>
                                        <bitOffset>0x8</bitOffset>
                                        <bitWidth>0x3</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>MODULE_ID</name>
                                        <description>Module Identification Number</description>
                                        <bitOffset>0x10</bitOffset>
                                        <bitWidth>0xC</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>SCHEME</name>
                                        <description>PID Register Scheme</description>
                                        <bitOffset>0x1E</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_CTRL</name>
                                <description>MCAN ECC Control</description>
                                <addressOffset>0x14</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000187</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>ECC_ENABLE</name>
                                        <description>Enable ECC Generation</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ECC_CHECK</name>
                                        <description>Enable ECC Check. ECC is completely bypassed if both ECC_ENABLE and ECC_CHECK are '0'.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ENABLE_RMW</name>
                                        <description>Enable read-modify-write on partial word writes</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>FORCE_SEC</name>
                                        <description>Force single-bit error. Cleared on a writeback or the cycle following the error if ERROR_ONCE is asserted. For write through mode, this applies to writes as well as reads. MCANERR_ERR_CTRL1 and MCANERR_ERR_CTRL2 should be configured prior to setting this bit.</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>FORCE_DED</name>
                                        <description>Force double-bit error. Cleared the cycle following the error if ERROR_ONCE is asserted. For write through mode, this applies to writes as well as reads. MCANERR_ERR_CTRL1 and MCANERR_ERR_CTRL2 should be configured prior to setting this bit.</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>FORCE_N_ROW</name>
                                        <description>Enable single/double-bit error on the next RAM read, regardless of the MCANERR_ERR_CTRL1.ECC_ROW setting. For write through mode, this applies to writes as well as reads.</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ERROR_ONCE</name>
                                        <description>If this bit is set, the FORCE_SEC/FORCE_DED will inject an error to the specified row only once. The FORCE_SEC bit will be cleared once a writeback happens. If writeback is not enabled, this error will be cleared the cycle following the read when the data is corrected. For double-bit errors, the FORCE_DED bit will be cleared the cycle following the double-bit error. Any subsequent reads will not force an error.</description>
                                        <bitOffset>0x6</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CHECK_SVBUS_TIMEOUT</name>
                                        <description>Enables Serial VBUS timeout mechanism</description>
                                        <bitOffset>0x8</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_ERR_CTRL1</name>
                                <description>MCAN ECC Error Control 1 Register</description>
                                <addressOffset>0x18</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_ERR_CTRL2</name>
                                <description>MCAN ECC Error Control 2 Register</description>
                                <addressOffset>0x1C</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>ECC_BIT1</name>
                                        <description>Column/Data bit that needs to be flipped when FORCE_SEC or FORCE_DED is set</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x10</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ECC_BIT2</name>
                                        <description>Second column/data bit that needs to be flipped when FORCE_DED is set</description>
                                        <bitOffset>0x10</bitOffset>
                                        <bitWidth>0x10</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_ERR_STAT1</name>
                                <description>MCAN ECC Error Status 1 Register</description>
                                <addressOffset>0x20</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>ECC_SEC</name>
                                        <description>Single Bit Error Corrected Status. A 2-bit saturating counter of the number of SEC errors that have occurred since last cleared.
 
  0  No single-bit error detected
  1  One single-bit error was detected and corrected
  2  Two single-bit errors were detected and corrected
  3  Three single-bit errors were detected and corrected
 
A write of a non-zero value to this bit field increments it by the value provided.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ECC_DED</name>
                                        <description>Double Bit Error Detected Status. A 2-bit saturating counter of the number of DED errors that have occurred since last cleared.
 
  0  No double-bit error detected
  1  One double-bit error was detected
  2  Two double-bit errors were detected
  3  Three double-bit errors were detected
 
A write of a non-zero value to this bit field increments it by the value provided.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ECC_OTHER</name>
                                        <description>SEC While Writeback Error Status
  0  No SEC error while writeback pending
  1  Indicates that successive single-bit errors have occurred while a writeback is still pending</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CTRL_REG_ERROR</name>
                                        <description>Control Register Error. A bit field in the control register is in an ambiguous state. This means that the redundancy registers have detected a state where not all values are the same and has defaulted to the reset state. S/W needs to re-write these registers to a known state. A write of 1 will set this interrupt flag.</description>
                                        <bitOffset>0x7</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CLR_ECC_SEC</name>
                                        <description>Clear ECC_SEC. A write of a non-zero value to this bit field decrements the ECC_SEC bit field by the value provided.</description>
                                        <bitOffset>0x8</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CLR_ECC_DED</name>
                                        <description>Clear ECC_DED. A write of a non-zero value to this bit field decrements the ECC_DED bit field by the value provided.</description>
                                        <bitOffset>0xA</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CLR_ECC_OTHER</name>
                                        <description>Writing a '1' clears the ECC_OTHER bit.</description>
                                        <bitOffset>0xC</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CLR_CTRL_REG_ERROR</name>
                                        <description>Writing a '1' clears the CTRL_REG_ERROR bit</description>
                                        <bitOffset>0xF</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>ECC_BIT1</name>
                                        <description>ECC Error Bit Position. Indicates the bit position in the RAM data that is in error on an SEC error. Only valid on an SEC error.
  0  Bit 0 is in error
  1  Bit 1 is in error
  2  Bit 2 is in error
  3  Bit 3 is in error
  ...
  31 Bit 31 is in error
  &gt;32 Invalid</description>
                                        <bitOffset>0x10</bitOffset>
                                        <bitWidth>0x10</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_ERR_STAT2</name>
                                <description>MCAN ECC Error Status 2 Register</description>
                                <addressOffset>0x24</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_MCANERR_ERR_STAT3</name>
                                <description>MCAN ECC Error Status 3 Register</description>
                                <addressOffset>0x28</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <resetMask>0xffffffff</resetMask>
                                <fields>
                                    <field>
                                        <name>WB_PEND</name>
                                        <description>Delayed Write Back Pending Status
  0  No write back pending
  1  An ECC data correction write back is pending</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-only</access>
                                        </field>
                                    <field>
                                        <name>SVBUS_TIMEOUT</name>
                                        <description>Serial VBUS Timeout Flag. Write 1 to set.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>CLR_SVBUS_TIMEOUT</name>
                                        <description>Write 1 to clear the Serial VBUS Timeout Flag</description>
                                        <bitOffset>0x9</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
