mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
A write of a non-zero value to this bit field decrements it by the value provided.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                    <field>
                                        <name>SVBUS_TIMEOUT</name>
                                        <description>Aggregator Serial VBUS Timeout Error Status
 
2-bit saturating counter of the number of SVBUS timeout errors that have occurred since last cleared.
  0  No timeout errors have occurred
  1  One timeout error has occurred
  2  Two timeout errors have occurred
  3  Three timeout errors have occurred
 
A write of a non-zero value to this bit field decrements it by the value provided.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x2</bitWidth>
                                        <access>read-write</access>
                                        </field>
                                </fields>
                            </register>
                        </cluster>
                    </cluster>
                    <cluster>
                        <dim>1</dim>
                        <dimIncrement>512</dimIncrement>
                        <dimArrayIndex>0</dimArrayIndex>
                        <name>CANFD0_MSP[%s]</name>
                        <description></description>
                        <addressOffset>0x600</addressOffset>
                        <cluster>
                            <dim>1</dim>
                            <dimIncrement>44</dimIncrement>
                            <dimArrayIndex>0</dimArrayIndex>
                            <name>CANFD0_CPU_INT[%s]</name>
                            <description></description>
                            <addressOffset>0x20</addressOffset>
                            <register>
                                <name>CANFD0_IIDX</name>
                                <description>Interrupt Index Register</description>
                                <addressOffset>0x0</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <fields>
                                    <field>
                                        <name>STAT</name>
                                        <description>Interrupt index status</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x8</bitWidth>
                                        <access>read-only</access>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_INTR</name>
                                                    <description>No interrupt pending.</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>INTL0</name>
                                                    <description>MCAN Interrupt Line 0 interrupt pending.</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>INTL1</name>
                                                    <description>MCAN Interrupt Line 1 interrupt pending.</description>
                                                    <value>0x2</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SEC</name>
                                                    <description>Message RAM SEC (Single Error Correction) interrupt pending.</description>
                                                    <value>0x3</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>DED</name>
                                                    <description>Message RAM DED (Double Error Detection)  interrupt pending.</description>
                                                    <value>0x4</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>EXT_TS_CNTR_OVFL</name>
                                                    <description>External Timestamp Counter Overflow interrupt pending.</description>
                                                    <value>0x5</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>WAKEUP</name>
                                                    <description>Clock Stop Wake Up interrupt pending.</description>
                                                    <value>0x6</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_IMASK</name>
                                <description>Interrupt mask</description>
                                <addressOffset>0x8</addressOffset>
                                <size>32</size>
                                <access>read-write</access>
                                <resetValue>0x00000000</resetValue>
                                <fields>
                                    <field>
                                        <name>INTL0</name>
                                        <description>MCAN Interrupt Line 0 mask.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt Mask</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrrupt Mask</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>INTL1</name>
                                        <description>MCAN Interrupt Line 1 mask.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt Mask</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrrupt Mask</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>SEC</name>
                                        <description>Message RAM SEC interrupt mask.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt Mask</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrrupt Mask</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>DED</name>
                                        <description>Massage RAM DED interrupt mask.</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt Mask</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrrupt Mask</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow interrupt mask.</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt Mask</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrrupt Mask</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>WAKEUP</name>
                                        <description>Clock Stop Wake Up interrupt mask.</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Clear Interrupt Mask</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrrupt Mask</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_RIS</name>
                                <description>Raw interrupt status</description>
                                <addressOffset>0x10</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <fields>
                                    <field>
                                        <name>INTL0</name>
                                        <description>MCAN Interrupt Line 0.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>INTL1</name>
                                        <description>MCAN Interrupt Line 1.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>SEC</name>
                                        <description>Message RAM SEC interrupt.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>DED</name>
                                        <description>Message RAM DED interrupt.</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>External Timestamp Counter Overflow interrupt.</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>WAKEUP</name>
                                        <description>Clock Stop Wake Up interrupt.</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                </fields>
                            </register>
