mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG0_CCCTL_01[%s]</name>
                        <description>Capture or Compare Control Registers 0/1</description>
                        <addressOffset>0x30</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCOND</name>
                                <description>Capture Condition. #br# Specifies the condition that generates a capture pulse.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOCAPTURE</name>
                                            <description>None (never captures)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_RISE</name>
                                            <description>Rising edge of CCP or trigger assertion edge</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_FALL</name>
                                            <description>Falling edge of CCP or trigger de-assertion edge</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_EDGE</name>
                                            <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>ACOND</name>
                                <description>Advance Condition. #br# Specifies the condition that generates an advance pulse.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>TIMCLK</name>
                                            <description>Each TIMCLK</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_RISE</name>
                                            <description>Rising edge of CCP or trigger assertion edge</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_FALL</name>
                                            <description>Falling edge of CCP or trigger de-assertion edge</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_EDGE</name>
                                            <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_HIGH</name>
                                            <description>CCP High or Trigger assertion (level)</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>LCOND</name>
                                <description>Load Condition. #br# Specifies the condition that generates a load pulse.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CC_TRIG_NO_EFFECT</name>
                                            <description>CCP edges have no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_RISE</name>
                                            <description>Rising edge of CCP or trigger assertion edge</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_FALL</name>
                                            <description>Falling edge of CCP or trigger de-assertion edge</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_EDGE</name>
                                            <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>ZCOND</name>
                                <description>Zero Condition. #br# This field specifies the condition that generates a zero pulse.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CC_TRIG_NO_EFFECT</name>
                                            <description>CCP edges have no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_RISE</name>
                                            <description>Rising edge of CCP or trigger assertion edge</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_FALL</name>
                                            <description>Falling edge of CCP or trigger de-assertion edge</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC_TRIG_EDGE</name>
                                            <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>COC</name>
                                <description>Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both).</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>COMPARE</name>
                                            <description>Compare</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CAPTURE</name>
                                            <description>Capture</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCACTUPD</name>
                                <description>CCACT shadow register Update Method
This field controls how updates to the CCACT shadow register are performed</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>Immediately</name>
                                            <description>Value written to the CCACT register has immediate effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Zero_EVT</name>
                                            <description>Following a zero event (CTR=0) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Compare_Down_EVT</name>
                                            <description>Following a CCD event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Compare_UP_EVT</name>
                                            <description>Following a CCU event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO_LOAD_EVT</name>
                                            <description>Following a zero event (CTR=0) or load event (CTR = LOAD) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO_RC_ZERO_EVT</name>
                                            <description>Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG</name>
                                            <description>On a TRIG pulse, the value stored in CCACT_xy shadow register is loaded into CCACT_xy register.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2SELU</name>
                                <description>Selects the source second CCU event.</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SEL_CCU0</name>
                                            <description>Selects CCU from CC0.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU1</name>
                                            <description>Selects CCU from CC1.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU2</name>
                                            <description>Selects CCU from CC2.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU3</name>
                                            <description>Selects CCU from CC3.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU4</name>
                                            <description>Selects CCU from CC4.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCU5</name>
                                            <description>Selects CCU from CC5.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2SELD</name>
                                <description>Selects the source second CCD event.</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SEL_CCD0</name>
                                            <description>Selects CCD from CC0.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD1</name>
                                            <description>Selects CCD from CC1.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD2</name>
                                            <description>Selects CCD from CC2.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD3</name>
                                            <description>Selects CCD from CC3.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD4</name>
                                            <description>Selects CCD from CC4.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SEL_CCD5</name>
                                            <description>Selects CCD from CC5.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
