mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG0_OCTL_01[%s]</name>
                        <description>CCP Output Control Registers 0/1</description>
                        <addressOffset>0x50</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCPOINV</name>
                                <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOINV</name>
                                            <description>No inversion</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INV</name>
                                            <description>Invert</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCPIV</name>
                                <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Low</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HIGH</name>
                                            <description>High</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCPO</name>
                                <description>CCP Output Source</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>FUNCVAL</name>
                                            <description>Signal generator value (for example, PWM, triggered PWM)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LOAD</name>
                                            <description>Load event</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CMPVAL</name>
                                            <description>CCU event or CCD event</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO</name>
                                            <description>Zero event</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CAPCOND</name>
                                            <description>Capture event</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FAULTCOND</name>
                                            <description>Fault condition</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC0_MIRROR_ALL</name>
                                            <description>Mirror CCP of first capture and compare register to other capture compare blocks</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC1_MIRROR_ALL</name>
                                            <description>Mirror CCP of second capture and compare register in other capture compare blocks</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DEADBAND</name>
                                            <description>Signal generator output after deadband insertion</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNTDIR</name>
                                            <description>Counter direction</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG0_CCACT_01[%s]</name>
                        <description>Capture or Compare Action Registers 0/1</description>
                        <addressOffset>0x70</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ZACT</name>
                                <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>LACT</name>
                                <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CDACT</name>
                                <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CUACT</name>
                                <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2DACT</name>
                                <description>CCP Output Action on CC2D event.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2UACT</name>
                                <description>CCP Output Action on CC2U event.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>SWFRCACT</name>
                                <description>CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
