mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DMA</name>
            <groupName>DMA</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x4042A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DMA_FSUB_0</name>
                    <description>Subscriber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-255 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-255 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_FPUB_1</name>
                    <description>Publisher Port 0</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-255 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STOP</name>
                                        <description>The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RUN</name>
                                        <description>The peripheral ignores the state of the Core Halted input</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SOFT</name>
                            <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>IMMEDIATE</name>
                                        <description>The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DELAYED</name>
                                        <description>The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>DMA_CPU_INT[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>DMA_CPU_INT_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No bit is set means there is no pending interrupt request</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH0</name>
                                            <description>DMA Channel 0 size counter reached zero (DMASZ=0).</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH1</name>
                                            <description>DMA Channel 1 size counter reached zero (DMASZ=0).</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH2</name>
                                            <description>DMA Channel 2 size counter reached zero (DMASZ=0).</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH3</name>
                                            <description>DMA Channel 3 size counter reached zero (DMASZ=0).</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH4</name>
                                            <description>DMA Channel 4 size counter reached zero (DMASZ=0).</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH5</name>
                                            <description>DMA Channel 5 size counter reached zero (DMASZ=0).</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH6</name>
                                            <description>DMA Channel 6 size counter reached zero (DMASZ=0).</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH7</name>
                                            <description>DMA Channel 7 size counter reached zero (DMASZ=0).</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH8</name>
                                            <description>DMA Channel 8 size counter reached zero (DMASZ=0).</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH9</name>
                                            <description>DMA Channel 9 size counter reached zero (DMASZ=0).</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH10</name>
                                            <description>DMA Channel 10 size counter reached zero (DMASZ=0).</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH11</name>
                                            <description>DMA Channel 11 size counter reached zero (DMASZ=0).</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH12</name>
                                            <description>DMA Channel 12 size counter reached zero (DMASZ=0).</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH13</name>
                                            <description>DMA Channel 13 size counter reached zero (DMASZ=0).</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH14</name>
                                            <description>DMA Channel 14 size counter reached zero (DMASZ=0).</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMACH15</name>
                                            <description>DMA Channel 15 size counter reached zero (DMASZ=0).</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH0</name>
                                            <description>PRE-IRQ event for DMA Channel 0.</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH1</name>
                                            <description>PRE-IRQ event for DMA Channel 1.</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH2</name>
                                            <description>PRE-IRQ event for DMA Channel 2.</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH3</name>
                                            <description>PRE-IRQ event for DMA Channel 3.</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH4</name>
                                            <description>PRE-IRQ event for DMA Channel 4.</description>
                                            <value>0x15</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH5</name>
                                            <description>PRE-IRQ event for DMA Channel 5.</description>
                                            <value>0x16</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH6</name>
                                            <description>PRE-IRQ event for DMA Channel 6.</description>
                                            <value>0x17</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PREIRQCH7</name>
                                            <description>PRE-IRQ event for DMA Channel 7.</description>
                                            <value>0x18</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ADDRERR</name>
                                            <description>DMA address error, SRC address not reachable.</description>
                                            <value>0x19</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DATAERR</name>
                                            <description>DMA data error, SRC data might be corrupted (PAR or ECC error).</description>
                                            <value>0x1A</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
