mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV24</name>
                                        <description>SYSPLLCLK0 is divided by 24</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV26</name>
                                        <description>SYSPLLCLK0 is divided by 26</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV28</name>
                                        <description>SYSPLLCLK0 is divided by 28</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV30</name>
                                        <description>SYSPLLCLK0 is divided by 30</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV32</name>
                                        <description>SYSPLLCLK0 is divided by 32</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSPLLREF</name>
                            <description>SYSPLLREF selects the system PLL (SYSPLL) reference clock source.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC</name>
                                        <description>SYSPLL reference is SYSOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>SYSPLL reference is HFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENABLECLK2X</name>
                            <description>ENABLECLK2X enables or disables the SYSPLLCLK2X output.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SYSPLLCLK2X is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SYSPLLCLK2X is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSPLLCFG1</name>
                    <description>SYSPLL reference and feedback divider</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007f03</resetMask>
                    <fields>
                        <field>
                            <name>PDIV</name>
                            <description>PDIV selects the SYSPLL reference clock prescale divider.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>REFDIV1</name>
                                        <description>SYSPLLREF is not divided</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>REFDIV2</name>
                                        <description>SYSPLLREF is divided by 2</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>REFDIV4</name>
                                        <description>SYSPLLREF is divided by 4</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>REFDIV8</name>
                                        <description>SYSPLLREF is divided by 8</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>QDIV</name>
                            <description>QDIV selects the SYSPLL feedback path divider.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x7</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>INVALID</name>
                                        <description>Divide-by-one is not a valid QDIV option</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>QDIVMIN</name>
                                        <description>Feedback path is divided by 2</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>QDIVMAX</name>
                                        <description>Feedback path is divided by 127 (0x7E)</description>
                                        <value>0x7E</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSPLLPARAM0</name>
                    <description>SYSPLL PARAM0 (load from FACTORY region)</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x9f3f3f3f</resetMask>
                    <fields>
                        <field>
                            <name>CPCURRENT</name>
                            <description>Charge pump current</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>CAPBOVERRIDE</name>
                            <description>CAPBOVERRIDE controls the override for Cap B</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Cap B override disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Cap B override enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STARTTIME</name>
                            <description>Startup time from enable to locked clock, in 1us resolution</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>CAPBVAL</name>
                            <description>Override value for Cap B</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>STARTTIMELP</name>
                            <description>Startup time from low power mode exit to locked clock, in 1us resolution</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSPLLPARAM1</name>
                    <description>SYSPLL PARAM1 (load from FACTORY region)</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff03ff1f</resetMask>
                    <fields>
                        <field>
                            <name>LPFCAPA</name>
                            <description>Loop filter Cap A</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>LPFRESC</name>
                            <description>Loop filter Res C</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>LPFRESA</name>
                            <description>Loop filter Res A</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0xA</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
