mspm0-rs/mspm0-data-sources/svd/MSPM0G320X.svd
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>SYSPLL started correctly and is enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>SYSPLL is disabled or was dead startup</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LFCLKFAIL</name>
                            <description>LFCLKFAIL indicates when the continous LFCLK monitor detects a LFXT or LFCLK_IN clock stuck failure.</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>No LFCLK fault detected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>LFCLK stuck fault detected</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSSTATUS</name>
                    <description>System status information</description>
                    <addressOffset>0x1208</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xc000f17f</resetMask>
                    <fields>
                        <field>
                            <name>SHDNIOLOCK</name>
                            <description>SHDNIOLOCK indicates when IO is locked due to SHUTDOWN</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>IO IS NOT Locked due to SHUTDOWN</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>IO IS Locked due to SHUTDOWN</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EXTRSTPINDIS</name>
                            <description>EXTRSTPINDIS indicates when user has disabled the use of external reset pin</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>External Reset Pin Enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>External Reset Pin Disabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SWDCFGDIS</name>
                            <description>SWDCFGDIS indicates when user has disabled the use of SWD Port</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>SWD Port Enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>SWD Port Disabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ANACPUMPGOOD</name>
                            <description>ANACPUMPGOOD is set by hardware when the VBOOST analog mux charge pump is ready.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>VBOOST is not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>VBOOST is ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BORLVL</name>
                            <description>BORLVL indicates if a BOR event occured and the BOR threshold was switched to BOR0 by hardware.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>No BOR violation occured</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>A BOR violation occured and the BOR threshold was switched to BOR0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MCAN0READY</name>
                            <description>MCAN0READY indicates when the MCAN0 peripheral is ready.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>MCAN0 is not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>MCAN0 is ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLASHDED</name>
                            <description>FLASHDED indicates if a flash ECC double bit error was detected (DED).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>No flash ECC double bit error detected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Flash ECC double bit error detected</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLASHSEC</name>
                            <description>FLASHSEC indicates if a flash ECC single bit error was detected and corrected (SEC).</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>No flash ECC single bit error detected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Flash ECC single bit error was detected and corrected</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PMUIREFGOOD</name>
                            <description>PMUIREFGOOD is set by hardware when the PMU current reference is ready.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>IREF is not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>IREF is ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REBOOTATTEMPTS</name>
                            <description>REBOOTATTEMPTS indicates the number of boot attempts taken before the user application starts.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>BORCURTHRESHOLD</name>
                            <description>BORCURTHRESHOLD indicates the active brown-out reset supply monitor configuration.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BORMIN</name>
                                        <description>Default minimum threshold; a BOR0- violation triggers a BOR</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORLEVEL1</name>
                                        <description>A BOR1- violation generates a BORLVL interrupt</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORLEVEL2</name>
                                        <description>A BOR2- violation generates a BORLVL interrupt</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORLEVEL3</name>
                                        <description>A BOR3- violation generates a BORLVL interrupt</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_DEDERRADDR</name>
                    <description>Memory DED Address</description>
                    <addressOffset>0x120C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_RSTCAUSE</name>
                    <description>Reset cause</description>
                    <addressOffset>0x1220</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>ID</name>
                            <description>ID is a read-to-clear field which indicates the lowest level reset cause since the last read.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NORST</name>
                                        <description>No reset since last read</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PORHWFAIL</name>
                                        <description>POR- violation, SHUTDNSTOREx or PMU trim parity fault</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>POREXNRST</name>
                                        <description>NRST triggered POR (&gt;1s hold)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PORSW</name>
                                        <description>Software triggered POR</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORSUPPLY</name>
                                        <description>BOR0- violation</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORWAKESHUTDN</name>
                                        <description>SHUTDOWN mode exit</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTNONPMUPARITY</name>
                                        <description>Non-PMU trim parity fault</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTCLKFAIL</name>
                                        <description>Fatal clock failure</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTEXNRST</name>
                                        <description>NRST triggered BOOTRST (&lt;1s hold)</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTSW</name>
                                        <description>Software triggered BOOTRST</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTWWDT0</name>
                                        <description>WWDT0 violation</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSBSLEXIT</name>
                                        <description>BSL exit</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSBSLENTRY</name>
                                        <description>BSL entry</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSWWDT1</name>
                                        <description>WWDT1 violation</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSFLASHECC</name>
                                        <description>Flash uncorrectable ECC error</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSCPULOCK</name>
                                        <description>CPULOCK violation</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSDBG</name>
                                        <description>Debug triggered SYSRST</description>
                                        <value>0x1A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSSW</name>
                                        <description>Software triggered SYSRST</description>
                                        <value>0x1B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CPUDBG</name>
                                        <description>Debug triggered CPURST</description>
                                        <value>0x1C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CPUSW</name>
                                        <description>Software triggered CPURST</description>
                                        <value>0x1D</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
